# Brewfile-app-dev
# Uncomment ones you might require or interested.

#==============================================================================
# Application Dev Tools
#==============================================================================
# build tools
brew 'maven'
brew 'gradle'
brew 'sbt'

#documentation
cask 'gitbook'
brew 'pandoc'

brew 'graphviz'

# web dev
#brew 'node'

# databases
brew 'postgresql', args: ['no-python']
brew 'redis'
cask 'razorsql' 
#brew 'rabbitmq'
#brew 'memcached'

## homebrew/apache
brew 'httpd24'

## apache thrift
brew 'thrift', args: ['--without-haskell --without-php --without-erlang']

#Mobile dev
#cask genymotion
cask 'charles'

#performance testing
brew 'ab'
brew 'wrk'

#Virtual env - docker
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
#cask 'vmware-fusion'
# docker
#brew 'boot2docker'
#brew 'docker-machine'
#brew 'docker-compose'
#cask 'kitematic'
# only dockertoolbox is required as it installs all that is required for docker.
# Commented out, use Docker for mac instead
#cask 'dockertoolbox'



#==============================================================================
# Optional Applications - typically required for developers.
#==============================================================================

# browsers
cask 'google-chrome'
cask 'opera'
cask 'firefox'
#cask 'lastpass'

# apps
#communication
cask 'skype'
cask 'slack'
cask 'google-hangouts'

#books
cask 'kindle'

#GTD (Get things done) - aka productivity
# mac store only - https://itunes.apple.com/in/app/todoist-to-do-list-task-list/id585829637?mt=12
#cask 'todoist'

#notes
cask 'evernote'

#music
cask 'spotify'

# drives
cask 'dropbox'
cask 'google-drive'
#cask 'skydrive' #onedrive

#productivity
#Install wunderlist from App Store, no cask available

#==============================================================================
# Extras
#==============================================================================

#cask ganttproject

#cask 'rdm'
#cask 'vlc'
#cask 'adium'
cask 'calibre'
#cask 'crashplan'
#cask 'flux'
#cask 'skitch'
#cask 'tinyumbrella'
#cask 'transmission-remote-gui'
#cask 'truecrypt71a'
#cask 'cyberduck'

cask 'flux'
