# Brewfile-app-dev
# Uncomment ones you might require or interested.

#==============================================================================
# Application Dev Tools
#==============================================================================
# CLI tool to install from mac store, incase cask/brew are not present
# Thanks and Courtesy to: https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# More details: https://github.com/mas-cli/mas
brew 'mas'

# build tools
brew 'maven'
brew 'gradle'
brew 'sbt'

#documentation
cask 'gitbook-editor'
brew 'pandoc'

brew 'graphviz'

# web dev
#brew 'node'

# databases
brew 'postgresql', args: ['no-python']
brew 'redis'
cask 'razorsql'
#brew 'rabbitmq'
#brew 'memcached'

## homebrew/apache
brew 'httpd24'

## apache thrift
brew 'thrift', args: ['--without-haskell --without-php --without-erlang']

#Mobile dev
#cask genymotion
cask 'charles'

#performance testing
#brew 'ab'
brew 'wrk'

# docker
cask 'docker'


# MachineLearning, AI
cask 'miniconda'

#==============================================================================
# Optional Applications - typically required for developers.
#==============================================================================

# browsers
cask 'google-chrome'
cask 'opera'
cask 'firefox'
#cask 'lastpass'

# password manager
cask 'dashlane'

# apps
#communication
cask 'skype'
cask 'slack'
cask 'google-hangouts'

#books
cask 'kindle'

#GTD (Get things done) - aka productivity
# mac store only - https://itunes.apple.com/in/app/todoist-to-do-list-task-list/id585829637?mt=12
#cask 'todoist'


# Peco to filter things like logs, process stats, find files.
# Interactive filter and look through the current results.
# More details: https://github.com/peco/peco/wiki/Sample-Usage
brew 'peco'

#notes,mindmap
cask 'evernote'
cask 'xmind'
cask 'anki'

#diagrams
cask 'drawio'

#music
cask 'spotify'

# drives
cask 'dropbox'
cask 'google-drive'
#cask 'skydrive' #onedrive

#productivity
#Install wunderlist from App Store, no cask available

#==============================================================================
# Extras
#==============================================================================

#cask ganttproject

#cask 'rdm'
#cask 'vlc'
#cask 'adium'
cask 'calibre'
#cask 'crashplan'
#cask 'flux'
#cask 'skitch'
#cask 'tinyumbrella'
#cask 'transmission-remote-gui'
#cask 'truecrypt71a'
#cask 'cyberduck'

cask 'flux'

cask 'amazon-music'

